---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FabricationServiceButton
source: html/b6c9e288-34d9-7064-d12e-aa3f162fe0c4.htm
---
# FabricationServiceButton Members

Checks to see if the fabrication part type exists on one of the button conditions.